app/views/posts/_form.html.erb

SELECT "categories".* FROM "categories"
---
    <%= form.label :category %>
    <%= form.collection_select:category_id, Category.all, :id, :name %>