app/controllers/posts_controller.rb

INSERT INTO "posts" ("name", "body", "created_at", "updated_at", "category_id") VALUES (?, ?, ?, ?, ?)  [["name", "erererer"], ["body", "rgjhkjhgdfsdascvbnmh"], ["created_at", "2018-01-23 11:40:37.585956"], ["updated_at", "2018-01-23 11:40:37.585956"], ["category_id", 1]]
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save

UPDATE "posts" SET "category_id" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["category_id", 1], ["updated_at", "2018-01-23 11:40:19.032932"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @post.update(post_params)